[
  {
    "title": "Policy Chatbot UI (Company Project)",
    "description": "Built UI screens using React, TypeScript, and MUI. Integrated REST APIs and improved user experience for internal chatbot workflows.",
    "link": ""
  },
  {
    "title": "Task & Ticket Management Platform (Company Project)",
    "description": "Developed pages, handled API integrations, optimized performance, and contributed to core modules of a Zoho-like management system.",
    "link": ""
  },
  {
    "title": "Dating App (iOS, Legacy Project)",
    "description": "Worked on a large React Native codebase, fixed bugs, refactored components, integrated APIs, and improved overall stability for iOS builds.",
    "link": ""
  },
  {
    "title": "Jewelry E-Commerce Website (Freelance)",
    "description": "Built responsive frontend UI using React, Tailwind, and GSAP animations. Designed smooth product interactions and mobile-friendly layouts.",
    "link": ""
  },
  {
    "title": "Habit-Builder (In-Progress)",
    "description": "PWA-style habit tracker built with Next.js, TypeScript, and MUI. Features streaks, daily tracking, and offline-first functionality.",
    "link": "https://github.com/Darshangohel2610/Habit-Builder"
  },
  {
    "title": "Mood-Based Content Recommender (Cloud-Native, In-Progress)",
    "description": "Emotion-based recommendation system using AWS Rekognition, Lambda, DynamoDB, and Next.js. Handles mood detection and personalized content suggestions.",
    "link": ""
  },
  {
    "title": "Portfolio",
    "description": "Personal portfolio built with React, TypeScript, Tailwind, and Framer Motion/GSAP. Showcases projects, animations, and experience with a clean UI.",
    "link": "https://github.com/Darshangohel2610/portfolio"
  },
  {
    "title": "Dev Playground",
    "description": "A repo of experimental code snippets, small features, and practice projects used to test new libraries, patterns, and UI ideas.",
    "link": "https://github.com/Darshangohel2610/some-random-codes"
  }
]
